service-zhwg-ywkt-mtosi-master/template/烽火/request/getTerminationPoint

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/mri/xsd/tpr/v1" xmlns:v12="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
   <soapenv:Header>
      <v1:header>
         <!--Optional:-->
         <v1:security>${#Project#security}</v1:security>
         <v1:communicationPattern>SimpleResponse</v1:communicationPattern>
         <v1:communicationStyle>RPC</v1:communicationStyle>
      </v1:header>
   </soapenv:Header>
   <soapenv:Body>
      <v11:getTerminationPointRequest>
         <!--Optional:-->
         <v11:tpRef>
            <!--Zero or more repetitions:-->
            <v12:rdn>
               <v12:type>MD</v12:type>
               <v12:value>1</v12:value>
            </v12:rdn>

            <v12:rdn>
               <v12:type>ME</v12:type>
               <v12:value>0a9a4094-f319-4586-8989-5c157faf3094</v12:value>
            </v12:rdn>
            <v12:rdn>
               <v12:type>PTP</v12:type>
               <v12:value>/rack=1/shelf=0/slot=8/port=1</v12:value>
            </v12:rdn>
                        

         </v11:tpRef>
      </v11:getTerminationPointRequest>
   </soapenv:Body>
</soapenv:Envelope>